import React from 'react';
import { Button, Col, Image, Row, Typography } from 'antd';
import { Link } from 'react-router-dom';

function Article2() {
  const { Title } = Typography;
  return (
    <>
      <Row justify="center" style={{ width: '100%', minHeight: '100%', marginTop: 32, marginBottom: 16 }}>
        <Col span={12}>
          <Image
            width={'90%'}
            src="https://www.frank.co.th/blog/wp-content/uploads/2020/08/%E0%B9%80%E0%B8%A1%E0%B8%99%E0%B8%B9%E0%B8%AD%E0%B8%B2%E0%B8%AB%E0%B8%B2%E0%B8%A3%E0%B8%84%E0%B8%99%E0%B8%97%E0%B9%89%E0%B8%AD%E0%B8%87-%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%A1%E0%B8%B5%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%82%E0%B8%A2%E0%B8%8A%E0%B8%99%E0%B9%8C%E0%B8%95%E0%B9%88%E0%B8%AD%E0%B8%84%E0%B8%B8%E0%B8%93%E0%B9%81%E0%B8%A1%E0%B9%88%E0%B8%95%E0%B8%B1%E0%B9%89%E0%B8%87%E0%B8%84%E0%B8%A3%E0%B8%A3%E0%B8%A0%E0%B9%8C_Blog.jpg"
          />
          <Title level={3} style={{ marginTop: 8 }}>
            จะดีแค่ไหน? เมื่อลูกน้อยกินอาหารที่ดีตั้งแต่อยู่ในครรภ์ เพื่อเสริมให้ลูกมีพัฒนาการ
            พร้อมเรียนรู้ด้วยโภชนาการง่ายๆ เพราะอาหารสำหรับคนท้องจะมีผลต่อร่างกายของเด็กโดยตรง
            เราจึงควรเลือกทานเมนูอาหารคนท้องที่เป็นประโยชน์ตั้งแต่เริ่มตั้งครรภ์ และเหมาะสมตามแต่ละไตรมาสด้วย
            ไม่ว่าจะเป็นไตรมาสแรกจนถึงไตรมาสใกล้คลอด ก็จะทำให้ลูกน้อยได้รับสารอาหารครบถ้วนมากขึ้น
            พร้อมช่วยบำรุงร่างกายคุณแม่ให้แข็งเเรง แถมเป็นเมนูอาหารลดความอ้วนอีกด้วยนะ
            ว่าแล้วอาหารที่คนท้องควรกินจะมีอะไรบ้าง มาอ่านกันเลย...
          </Title>
          <Title style={{ marginTop: 8 }}>อาหารคนท้องไตรมาสที่ 1</Title>
          <Image
            width={'90%'}
            src="https://www.bolttech.co.th/blog/wp-content/uploads/2020/08/%E0%B9%80%E0%B8%A1%E0%B8%99%E0%B8%B9%E0%B8%AD%E0%B8%B2%E0%B8%AB%E0%B8%B2%E0%B8%A3%E0%B8%84%E0%B8%99%E0%B8%97%E0%B9%89%E0%B8%AD%E0%B8%87-%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%A1%E0%B8%B5%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%82%E0%B8%A2%E0%B8%8A%E0%B8%99%E0%B9%8C%E0%B8%95%E0%B9%88%E0%B8%AD%E0%B8%84%E0%B8%B8%E0%B8%93%E0%B9%81%E0%B8%A1%E0%B9%88%E0%B8%95%E0%B8%B1%E0%B9%89%E0%B8%87%E0%B8%84%E0%B8%A3%E0%B8%A3%E0%B8%A0%E0%B9%8C-1.jpg"
          />
          <Title level={3} style={{ marginTop: 8 }}>
            ในช่วงไตรมาสเดือนที่ 1-3 ของการตั้งครรภ์ คุณแม่หลายคนอาจจะมีอาการแพ้ท้อง อาการคลื่นไส้ และอาเจียน
            จึงทำให้ไม่สามารถทานอาหารได้ ดังนั้น คุณแม่ควรเลือกเมนูอาหารอ่อนๆ
            เพื่อให้ลูกน้อยได้รับสารอาหารที่เป็นประโยชน์ ได้แก่ อาหารที่มีโปรตีนและโอเมก้า 3 เช่น ปลาแซลมอน เต้าหู้ ไข่
            ไก่ เนื่องจากโปรตีนจะช่วยเสริมสร้างกล้ามเนื้อ และการเจริญเติบโตของเด็กทารก ยกเว้นอาหารเนื้อสัตว์ติดมัน
            และอาหารทะเลบางชนิดที่มีสารพิษตกค้าง เพื่อป้องกันการติดเชื้อในทารก ผลิตภัณฑ์ที่ทำมาจากนม
            หากคุณแม่ตั้งครรภ์ที่ไม่แพ้นม ก็สามารถดื่มนมในปริมาณที่เหมาะสมได้ เพราะนมจะมีทั้งโปรตีน เเคลเซียม วิตามิน
            และกรดโฟลิก ที่ช่วยเสริมสร้างกระดูกของทารกและคุณแม่ให้แข็งแรง แต่ไม่ควรดื่มเกิน 3 แก้วต่อวัน
            อาหารที่มีธาตุเหล็ก สำหรับเมนูคนท้องที่แนะนำให้ทาน ได้แก่ ข้าวโอ๊ต ถั่ว ลูกเดือย และข้าวกล้อง
            ธาตุเหล็กจะมีส่วนสำคัญในการสร้างเซลล์เม็ดเลือดในร่างกายของเด็กทารก และช่วยป้องกันภาวะโลหิตจางด้วย
            อาหารที่มีโฟเลต จำพวกผักและผลไม้ เช่น มะเขือเทศ ส้ม บร็อกโคลี ผักโขม มันฝรั่ง รวมถึงผักใบเขียวต่างๆ
            ทั้งนี้อาหารที่มีโฟเเลตจะมีผลต่อการพัฒนาสมอง ไขสันหลัง กระดูกสันหลังของทารกในระยะแรก
          </Title>
          <Title style={{ marginTop: 8 }}>อาหารคนท้องไตรมาสที่ 2</Title>
          <Image
            width={'90%'}
            src="https://www.bolttech.co.th/blog/wp-content/uploads/2020/08/%E0%B9%80%E0%B8%A1%E0%B8%99%E0%B8%B9%E0%B8%AD%E0%B8%B2%E0%B8%AB%E0%B8%B2%E0%B8%A3%E0%B8%84%E0%B8%99%E0%B8%97%E0%B9%89%E0%B8%AD%E0%B8%87-%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%A1%E0%B8%B5%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%82%E0%B8%A2%E0%B8%8A%E0%B8%99%E0%B9%8C%E0%B8%95%E0%B9%88%E0%B8%AD%E0%B8%84%E0%B8%B8%E0%B8%93%E0%B9%81%E0%B8%A1%E0%B9%88%E0%B8%95%E0%B8%B1%E0%B9%89%E0%B8%87%E0%B8%84%E0%B8%A3%E0%B8%A3%E0%B8%A0%E0%B9%8C-2-2.jpg"
          />
          <Title level={3} style={{ marginTop: 8 }}>
            เมื่อเข้าสู่เดือนที่ 4-6 ของการตั้งครรภ์ ในช่วงนี้อาการแพ้ท้องของคุณแม่จะลดลง ไม่มีอาการคลื่นไส้
            อาเจียนมากนัก แต่จะเริ่มรู้สึกหิวบ่อยมากขึ้น แล้วเด็กทารกก็จะเริ่มมีการเจริญเติบโต พอคุณแม่กินอะไร
            ลูกน้อยก็จะกินตามไปด้วย ดังนั้น อาหารที่คนท้องควรกินจะต้องใส่ใจเป็นพิเศษ
            เพื่อช่วยในการพัฒนาร่างกายและสมองของลูกน้อย อาหารที่มีไอโอดีน เช่น สาหร่าย ปลาทูนึ่ง และกุ้งทะล เป็นต้น
            เนื่องจากคุณแม่ตั้งครรภ์ต่อมไทรอยด์จะทำงานหนัก ร่างกายจึงต้องการไอโอดีนเพิ่มขึ้น
            ไอโอดีนจะช่วยให้การเจริญเติบโตของต่อมไทรอยด์เป็นปกติ กระตุ้นการทำงานของหัวใจ
            และช่วยในการผลิตน้ำนมของคุณแม่อีกด้วย อาหารที่ธาตุเหล็ก เช่น ฝักทอง บร็อกโคลี ตำลึง จะช่วยดูดซึมธาตุเหล็ก
            เสริมสร้างเม็ดเลือดให้กับร่างกาย อาหารที่เป็นธัญพืช เช่น ลูกเกด ลูกเดือย ข้าวโอ๊ต ข้าวบาร์เลย์ เมล็ดฟักทอง
            ขนมปังธัญพืช อัลมอนด์ และเมล็ดงา ทั้งหมดนี้เป็นอาหารสำหรับคนท้องที่ให้พลังงานอย่างคาร์โบไฮเดรต
            และมีสารต้านอนุมูลอิสระด้วยนะ ผักที่มีใยอาหาร ได้แก่ แครอท ผักคะน้า มะเขือ ดอกกะหล่ำ และผักใบเขียวเข้ม
            เพราะว่า ผักใบเขียวจะช่วยป้องกันโรคท้องผูก เสริมภูมิคุ้มกันให้กับร่างกายคุณแม่และลูกน้อย
            แถมยังช่วยต้านโรคเบาหวานด้วยการกินผักสมุนไพรอีกด้วย ผลไม้ที่มีวิตามินสูง ไม่ว่าจะเป็นส้ม กีวี สตอเบอรี่
            เชอรี่ ฝรั่ง กล้วย แอปเปิ้ล มะละกอสุก จะอุดมไปด้วยเกลือแร่และวิตามิน มีคุณสมบัติช่วยป้องกันหวัด
            และช่วยในเรื่องของระบบขับถ่ายได้ดี
          </Title>
          <Button danger>
            <Link to="/mother/article">ย้อนกลับ</Link>
          </Button>
        </Col>
      </Row>
    </>
  );
}

export default Article2;
