import React from 'react';
import { Button, Col, Image, Row, Typography } from 'antd';
import { Link } from 'react-router-dom';

function Article1() {
  const { Title } = Typography;
  return (
    <>
      <Row justify="center" style={{ width: '100%', minHeight: '100%', marginTop: 32, marginBottom: 16 }}>
        <Col span={12}>
          <Title>คุณแม่ต้องรู้! การนับลูกดิ้นเป็นสิ่งสำคัญสำหรับคุณแม่ตั้งครรภ์</Title>
          <Image
            width={'90%'}
            src="https://www.parentsone.com/wp-content/uploads/2019/06/fetal-movement-in-pregnancy_11-80.jpg"
          />
          <Title level={3}>
            ในระหว่างการตั้งครรภ์นอกจากจะต้องดูแลเรื่องสุขภาพของคุณแม่แล้ว
            สุขภาพของเจ้าตัวเล็กก็เป็นสิ่งสำคัญที่คุณแม่ต้องใส่ใจให้มาก
            ซึ่งก็มีทั้งการอัลตร้าซาวด์โดยคุณหมอและคุณแม่ก็สามารถดูสุขภาพของลูกได้ง่ายๆ จากการนับการดิ้นของลูกในครรภ์ค่ะ
            วันนี้เราจึงมีข้อมูลเกี่ยวกับการนับลูกดิ้นที่สำคัญๆ มาฝากคุณแม่ทุกคนค่า
          </Title>
          <Image
            width={'90%'}
            src="https://www.parentsone.com/wp-content/uploads/2019/06/fetal-movement-in-pregnancy_1-80.jpg"
          />
          <Title level={1} style={{ marginTop: 16 }}>
            ลูกดิ้นสำคัญยังไง ?
          </Title>
          <Title level={3}>
            เป็นสัญญาณที่บ่งบอกว่าลูกในครรภ์ยังมีสุขภาพที่ดี นอกจากนี้ยังบอกได้อีกด้วยว่าช่วงไหนที่ลูกกำลังหลับหรือตื่น
            โดยเฉพาะในช่วงไตรมาสสุดท้ายของการตั้งครรภ์ (เดือนที่ 7 เป็นต้นไป)
            เพราะการดิ้นจะเป็นสิ่งที่บอกว่าลูกยังมีสุขภาพดีหากมีการดิ้นอย่างสม่ำเสมอ
            โดยเราจะรู้สึกว่าลูกดิ้นได้ตั้งแต่สัปดาห์ที่ 18-20
            แต่จำนวนครั้งการดิ้นอาจจะไม่เท่ากันในแต่ละวันจึงทำให้ยังนับอย่างชัดเจนไม่ได้ แต่หลังจากสัปดาห์ที่ 28
            หรือเดือนที่ 7 ของการตั้งครรภ์ไปแล้ว การดิ้นของลูกจะสม่ำเสมอและค่อนข้างคงที่
            คุณแม่จึงเริ่มนับการดิ้นของลูกเพื่อเฝ้าติดตามสุขภาพของเจ้าตัวเล็กในครรภ์ได้ค่ะ
          </Title>
          <Button danger>
            <Link to="/mother/article">ย้อนกลับ</Link>
          </Button>
        </Col>
      </Row>
    </>
  );
}

export default Article1;
