import React from 'react';
import { Button, Col, Image, Row, Typography } from 'antd';
import { Link } from 'react-router-dom';

function Article3() {
  const { Title } = Typography;
  return (
    <>
      <Row justify="center" style={{ width: '100%', minHeight: '100%', marginTop: 32, marginBottom: 16 }}>
        <Col span={12}>
          <Image
            width={'90%'}
            src="https://www.thaihealth.or.th/data/content/2019/04/48292/cms/newscms_thaihealth_c_adeglnoqux17.jpg"
          />
          <Title level={3} style={{ marginTop: 8 }}>
            การออกกำลังกายเป็นเรื่องที่คุณแม่กำลังตั้งครรภ์ควรคำนึงถึง
            เพราะถ้าคุณแม่ร่างกายแข็งแรงลูกน้อยในครรภ์ก็จะสุขภาพแข็งแรงไปด้วย ดังนั้น
            คุณแม่จะต้องมีการเตรียมตัวและหาความรู้เพิ่มเติมเกี่ยวกับการออกกำลังกายด้วย
          </Title>
          <Title level={3} style={{ marginTop: 8 }}>
            1. ประเมินความพร้อมร่างกายของตนเองก่อนมีกิจกรรมทางกาย ปรึกษาแพทย์หากมีปัจจัยเสี่ยงต่าง ๆ เช่น
            โรคหัวใจหรือปอดชนิดรุนแรง ปากมดลูกหย่อน มีเลือดออกผิดปกติทางช่องคลอด ภาวะรกเกาะต่ำ มีอาการเจ็บครรภ์ก่อนกำหนด
            ครรภ์เป็นพิษ มีประวัติแท้ง หรือแท้งคุกคาม{' '}
          </Title>{' '}
          <Title level={3} style={{ marginTop: 8 }}>
            2. เริ่มต้นจากเบาไปหนัก ช้าไปเร็ว เพิ่มความหนักจนถึงระดับหนักปานกลาง
            และระดับหนักมากหรือจนรู้สึกเหนื่อยมากตามลำดับ
            โดยเฉพาะผู้ที่ไม่เคยมีกิจกรรมทางกายระดับปานกลางถึงหนักอย่างต่อเนื่องมาก่อน
            ควรเริ่มต้นจากการมีกิจกรรมทางกายในกิจวัตรประจำวัน
          </Title>{' '}
          <Title level={3} style={{ marginTop: 8 }}>
            3. อบอุ่นร่างกาย ยืดเหยียด (warm up) และคลายอุ่น (cool down)
            ก่อนและหลังการมีกิจกรรมทางกายระดับปานกลางและหนักทุกครั้ง{' '}
          </Title>
          <Title level={3} style={{ marginTop: 8 }}>
            4. จัดสภาพแวดล้อมให้เหมาะสมกับการมีกิจกรรมทางกาย จะช่วยเพิ่มโอกาสการเคลื่อนไหวร่างกายในบ้าน
            และสถานที่ทำงานให้มากที่สุดเท่าที่สามารถทำได้ และเพื่อหลีกเลี่ยงท่าทางที่ไม่เป็นธรรมชาติ
            หรือท่าทางที่อาจทำให้เกิดการเจ็บป่วย เช่น จัดโต๊ะทำงาน และเก้าอี้ ให้เหมาะกับสรีระ ปรับระดับพื้นให้ราบเรียบ
            จัดเก็บของให้เป็นระเบียบ ป้องกันการหกล้ม เป็นต้น
          </Title>{' '}
          <Title level={3} style={{ marginTop: 8 }}>
            5. ควรมีกิจกรรมทางกายในสภาพอากาศที่เหมาะสม หลีกเลี่ยงอากาศหนาวจัด หรือร้อนจัดมีแสงแดดมาก ๆ
            ซึ่งหากร่างกายได้รับความร้อนสูงเกินไป ถ้ามีอาการ เช่น ปวดศีรษะ วิงเวียน หน้ามืด เป็นลม คลื่นไส้ ตะคริว
            ใจสั่น ควรหยุดทำกิจกรรมทันที และไปพักในอากาศที่เย็นกว่า
          </Title>
          <Title level={3} style={{ marginTop: 8 }}>
            {' '}
            6. ดื่มน้ำเปล่าที่สะอาดทีละน้อย แต่บ่อยครั้ง เพื่อทดแทนน้ำที่สูญเสียไป โดยดื่มได้ทั้งก่อน ระหว่าง
            และหลังจากมีกิจกรรมทางกาย โดยระหว่างมีกิจกรรมทางกายติดต่อกัน ควรพักดื่มน้ำทุก ๆ 10-20 นาที
            หรือใช้วิธีจิบน้อย ๆ แต่บ่อยครั้ง ทั้งนี้ในกรณีที่ร่างกายส่งสัญญาณเตือนว่ากำลังขาดน้ำ เช่น คอแห้ง
            น้ำลายเหนียว ก็ควรพักหรือหยุดการทำกิจกรรม แล้วดื่มน้ำเพิ่มเติม 2-3 อีก แต่งกายให้เหมาะกับกิจกรรม
            เสื้อผ้าไม่รุ่มร่าม ไม่รัดแน่นเกินไป รองเท้าที่รับน้ำหนักได้ดี
          </Title>
          <Button danger>
            <Link to="/mother/article">ย้อนกลับ</Link>
          </Button>
        </Col>
      </Row>
    </>
  );
}

export default Article3;
